using System.ComponentModel;

namespace Core.Model
{

    public enum ExamTestScoreHistoryType : byte
    {
        Unknown = 0,
        اعتراض = 1,
        مدیر_سیستم = 2
    }

    public enum TransactionResult : byte
    {
        Unknown = 0,
        تراکنش_موفق = 1,
        تراکنش_ناموفق = 2,
        عدم_انجام_تراکنش = 3,
    }

    public enum ApplicantType : byte
    {
        Unknown = 0,

        ثبت_نام_کنندگان_آزمون = 1,
        ثبت_نام_کنندگان_معافیت = 2,
        واجدین_شرایط = 3,
        غیر_واجدین = 4,
        مشروطین = 5,
        در_مرحله_تکمیل_مدارک = 6,
        مشمولین_مصاحبه = 7,
        قبول_شدگان = 8,
        مردود_شدگان = 9
    }

    public enum DeprivedType : byte
    {
        Unknown = 0,
        دائمی = 1,
        موقت = 2
    }

    public enum ObjectionResult : byte
    {
        Unknown = 0,
        اعتراض_وارد_است = 1,
        اعتراض_وارد_نیست = 2
    }

    public enum ObjectionType : byte
    {
        Unknown = 0,
        اعتراض_به_غیر_واجد_شدن = 1,
        اعتراض_به_نمره = 2,
        اعتراض_به_نتیجه_معافیت_از_آزمون = 3
    }

    public enum ProtectionUnitConfirmType : byte
    {
        Unknown = 0,
        تایید = 1,
        عدم_تایید = 2
    }

    public enum InterviewResult : byte
    {
        Unknown = 0,
        قبول = 1,
        مردود = 2,
        غائب = 3
    }

    public enum InquiryType : byte
    {
        Unknown = 0,
        استعلام_عدم_سوء_پیشینه = 1,
        استعلام_عدم_اعتیاد = 2,
        استعلام_مدرک_تحصیلی = 3,
        استعلام_سوابق_کاری = 4,
        استعلام_حسن_انجام_کار = 5
    }

    public enum InquiryState : byte
    {
        Unknown = 0,
        ارسال_نشده = 1,
        عدم_نیاز_به_استعلام = 2,
        در_انتظار_پاسخ_استعلام = 3,
        تایید_استعلام = 4,
        عدم_تایید_استعلام = 5
    }

    public enum ExamAdmissionAgreementType : byte
    {
        Unknown = 0,
        قبلا_در_آزمون_انتخاب_حسابدار_رسمی_ثبت_نام_نموده_ام_و_كارت_شركت_در_آزمون_صادر_شده_است = 1,
        قبلا_در_آزمون_انتخاب_حسابدار_رسمی_ثبت_نام_نموده_ام_و_غیرواجد_شرایط_شده_ام = 2,
        برای_بار_اول_است_که_ثبت__نام_می_کنم = 3
    }

    public enum ExemptionAdmissionAgreementType : byte
    {
        Unknown = 0,
        قبلا_جهت_معافیت_از_آزمون_ثبت_نام_نموده_ام_و_مشمول_معافیت_قرارنگرفته_ام = 1,
        قبلا_جهت_معافیت_از_آزمون_ثبت_نام_نموده_و_مشمول_مصاحبه_قرار_گرفته_ام = 2,
        برای_بار_اول_است_که_ثبت_نام_می_کنم = 3
    }

    //نظر رئیس گروه
    public enum GroupHeadOpinionType : byte
    {
        Unknown = 0,
        موافق = 1,
        مخالف = 2
    }

    //دلیل نقص پرونده
    public enum DocumentDefectReasonType : byte
    {
        Unknown = 0,
        مدرک_تحصیلی = 1,
        ریز_نمرات = 2,
        سوابق_کاری = 3,
        عکس = 4,
        کارت_پایان_خدمت = 5,
        سوابق_بیمه = 6,
        شناسنامه = 7,
        کارت_ملی = 8,
        مدرک_حرفه_ای = 9,
        سوابق_مدیریتی = 10,
        احکام_کارگزینی = 11
    }

    //دلیل طرح در هیات
    public enum DiscussInPanelReasonType : byte
    {
        Unknown = 0,
        دكتری_حسابداری = 1,
        مدارك_حرفه_ای = 2,
        سوابق_كاری_مورد_ابهام = 3,
        مدرك_تحصیلی_مورد_ابهام = 4,
        نداشتن_كارت_پایان_خدمت = 5,
        سایر_موارد = 6
    }

    //دلیل غیر مجاز بودن
    public enum UnAllowedReasonType : byte
    {
        Unknown = 0,
        نداشتن_كارت_پایان_خدمت = 1,
        كسر_سابقه_حسابرسی = 2,
        كسر_سوابق_تجارب_مفید = 3,
        مدرك_تحصیلی_غیر_مرتبط = 4,
        عدم_تكمیل_نواقص_پرونده = 5,
        نداشتن_حداقل_ده_سال_سابقه_مدیریتی = 6
    }

    //دلیل غیر واجد بودن
    public enum UnEligibleReasonType : byte
    {
        Unknown = 0,
        نداشتن_كارت_پایان_خدمت = 1,
        كسر_سابقه_حسابرسی = 2,
        كسر_سوابق_تجارب_مفید = 3,
        مدرك_تحصیلی_غیر_مرتبط = 4,
        عدم_تكمیل_نواقص_پرونده = 5
    }

    // دلیل واجد بودن
    public enum EligibleReasonType : byte
    {
        Unknown = 0,
        واجد_شرایط_3_ساله = 1,
        واجد_شرایط_6_ساله = 2,
        مشروط_3_ساله = 3,
        مشروط_6_ساله = 4,
        دكتری_3_ساله = 5,
        دكتری_6_ساله = 6,
        مجامع_حرفه_ای_3_ساله = 7,
        مجامع_حرفه_ای_6_ساله = 8
    }

    public enum ExamSecretaryConfirmType : byte
    {
        Unknown = 0,

        واجد_شرایط = 1,
        غیر_واجد_شرایط = 2,
        بررسی_مجدد_کارشناس = 3,
        بررسی_مجدد_رئیس_گروه = 4,
    }

    public enum ExemptionSecretaryConfirmType : byte
    {
        Unknown = 0,

        معافیت_بدون_مصاحبه_با_دستورو_تایید_وزیر = 101,
        معافیت_بدون_مصاحبه_با_دستور_و_تایید_هیات_تشخیص_صلاحیت = 102,
        معافیت_به_شرط_مصاحبه = 103,
        بررسی_مجدد_کارشناس = 104, 
        غیر_واجد_شرایط_معافیت = 105,
        بررسی_مجدد_رئیس_گروه = 106
    }

    public enum ExamBossConfirmType : byte
    {
        Unknown = 0,
        تایید = 1,
        عدم_تایید = 2
    }

    public enum ExemptionBossConfirmType : byte
    {
        Unknown = 0,
        تایید = 101,
        عدم_تایید = 102
    }

    public enum ExamExpertConfirmType : byte
    {
        Unknown = 0,
        واجد_شرایط = 1,
        غیر_واجد_شرایط = 2,
        طرح_در_هیات = 3,
        مدارك_ناقص_و_ارسال_جهت_تكمیل_پرونده = 4,
        مدارك_ناقص_و_غیر_واجد_شرایط = 5
    }

    public enum ExemptionExpertConfirmType : byte
    {
        Unknown = 0,
        مجاز = 101,
        غیر_مجاز = 102,
        طرح_در_هیات = 103,
        مدارك_ناقص_و_ارسال_جهت_تكمیل_پرونده = 104,
        مدارك_ناقص_و_غیر_مجاز = 105
    }

    public enum ObjectionSecretaryConfirmType : byte
    {
        Unknown = 0,
        تایید = 101,
        عدم_تایید = 102
    }

    public enum EnableOrDisable : byte
    {
        Unknown = 0,
        فعال = 1,
        غیر_فعال = 2,
    }

    public enum PersianLetterType : byte
    {
        Unknown = 0,
        آ = 3,
        ا = 5,
        ب = 10,
        پ = 15,
        ت = 20,
        ث = 25,
        ج = 30,
        چ = 35,
        ح = 40,
        خ = 45,
        د = 50,
        ذ = 55,
        ر = 60,
        ز = 65,
        ژ = 70,
        س = 75,
        ش = 80,
        ص = 85,
        ض = 90,
        ط = 95,
        ظ = 100,
        ع = 105,
        غ = 110,
        ف = 115,
        ق = 120,
        ک = 125,
        گ = 130,
        ل = 135,
        م = 140,
        ن = 145,
        و = 150,
        ه = 155,
        ی = 160
    }

    public enum ManagementType : byte
    {
        Unknown = 0,
        حسابرسی = 1,
        مالی = 2,
        محاسباتی = 3,
        مالیاتی = 4
    }

    public enum MilitaryServiceType: byte
    {
        Unknown = 0,

        پایان_خدمت = 2,
        معاف_از_خدمت = 3,
        امریه = 5,
        طرح_سربازی = 9
    }

    public enum ProfessionalDegreeType : byte
    {
        Unknown = 0,

        انجمن_حسابداران_خبره_انگلستان_و_ویلز_ICAEW = 21,
        انجمن_حسابدران_رسمی_انگلستان_ACCA = 22,
        انجمن_حسابدران_رسمی_آمریکا_AICPA = 23,
        انجمن_حسابدران_کانادا_CGA = 24,
        سایر_مدارک_حرفه_ای_بین_المللی = 25
    }

    public enum WorkActivityType : byte
    {
        Unknown = 0,

        تمام_وقت = 1,
        پاره_وقت = 2
    }

    public enum WorkPlaceType : byte
    {
        Unknown = 0,

        موسسات_حسابرسی_عضو_جامعه = 14,
        سایر_مراکز_و_سازمان_ها = 16
    }

    public enum WorkPlaceGovernmentalType : byte
    {
        Unknown = 0,

        دولتی = 1,
        خصوصی = 2,
        سایر = 3
    }

    public enum WorkExperienceType : byte
    {
        Unknown = 0,
        حسابرسی_در_سازمان_حسابرسی = 1,
        //سایر = 2,
        //تدریس = 3,
        //حسابداری = 6,
        //حسابرسی_داخلی = 7,
        //طراحی_سیستم = 8,
        //مدیریت_مالی = 9,
        تدریس_در_دانشگاهها_با_سمت_عضویت_در_هیات_علمی_تمام_وقت_در_گروه_حسابداری = 10,
        خدمات_مالی_وحسابداری = 11,
        //امور_محاسباتی = 12,
        //امورمالیاتی = 13,
        حسابرسی_در_موسسات_حسابرسی_عضوجامعه_حسابداران_رسمی = 14,
        //ذیحسابی_ها = 15
        حسابرسی_وخدمات_مالی_در_سایر_مراكز_و_سازمان_ها = 16,
        سایر = 17
    }

    public enum DocState : short
    {
        Unknown = 0,
        ثبت_اولیه = 1,
        ارسال_متقاضی = 3,
        رفع_نواقص = 5,
        بررسی_کارشناس = 10,
        در_دست_بررسی = 50,
        نهایی_شده = 100
    }

    public enum ExamAdmissionRequestDocState : short
    {
        Unknown = 0,
        ثبت_اولیه = 1,
        ارسال_متقاضی = 3,
        رفع_نقص_پرونده = 5,
        بررسی_کارشناس = 10,
        بررسی_رئیس_گروه = 20,
        بررسی_دبیر_هیات = 30,
        بررسی_معاون_مرکز = 32,
        بررسی_رئیس_هیات = 34,
        بررسی_عضو_هیات = 36,
        شرکت_در_آزمون = 40,
        انجام_استعلامات = 50,
        بررسی_حراست = 60,
        در_انتظار_معرفی_به_جامعه_حسابداران_رسمی = 70,
        قبول_نهایی_و_معرفی_به_جامعه_حسابداران_رسمی = 100,
        
        غیر_واجد_شرایط_برای_شرکت_در_آزمون = 210,
        عدم_قبولی_در_آزمون = 220,
        در_انتظار_تکمیل_سنوات = 230,
        عدم_تایید_استعلامات = 240,
        عدم_تایید_حراست = 250
    }

    public enum ExemptionAdmissionRequestDocState : short
    {
        Unknown = 0,
        ثبت_اولیه = 1,
        ارسال_متقاضی = 3,
        رفع_نقص_پرونده = 5,
        بررسی_کارشناس = 10,
        بررسی_رئیس_گروه = 20,
        بررسی_دبیر_هیات = 30,
        بررسی_معاون_مرکز = 32,
        بررسی_رئیس_هیات = 34,
        بررسی_عضو_هیات = 36,
        دعوت_به_مصاحبه = 40,
        انجام_استعلامات = 50,
        بررسی_حراست = 60,
        در_انتظار_معرفی_به_جامعه_حسابداران_رسمی = 70,
        غیر_واجد_شرایط_معافیت = 80,
        قبول_نهایی_و_معرفی_به_جامعه_حسابداران_رسمی = 100,

        عدم_قبولی_در_مصاحبه = 220,
        عدم_تایید_استعلامات = 240,
        عدم_تایید_حراست = 250
    }

    public enum ObjectionRequestDocState : short
    {
        Unknown = 0,
        ثبت_اولیه = 1,
        بررسی_کارشناس = 5,
        بررسی_دبیر_هیات = 10,
        نهایی_شده = 100
    }

    public enum VerifyState : byte
    {
        Unknown = 0,
        کامل_است = 1,
        دارای_نقص_است = 2
    }

    public enum ExamResult : byte
    {
        Unknown = 0,
        قبول = 1,
        مردود = 2,
    }

    public enum TestType : byte
    {
        Unknown = 0,
        حسابداری = 1,
        حسابرسی = 2,
        حسابداری_و_حسابرسی = 3,
        قانون_مالیات_ها = 4,
        حسابداری_و_قانون_مالیات_ها = 5,
        قانون_مالیات_ها_و_حسابرسی = 6,
        حسابداری_و_حسابرسی_و_قانون_مالیات_ها = 7,
        سایر_قوانین = 8,
        حسابداری_و_سایر_قوانین = 9,
        حسابرسی_و_سایر_قوانین = 10,
        حسابداری_و_حسابرسی_و_سایر_قوانین = 11,
        قانون_مالیات_ها_و_سایر_قوانین = 12,
        حسابداری_و_قانون_مالیات_ها_و_سایر_قوانین = 13,
        حسابرسی_و_قانون_مالیات_ها_و_سایر_قوانین = 14,
        همه_آزمون_ها = 15,
        Red = 16
    }

    public enum TestState : byte
    {
        Unknown = 0,
        شرکت_در_آزمون = 1,
        معاف_از_آزمون = 2,
        قبولی_در_سال_های_قبل = 3   //مشروط
    }

    public enum AdmissionType : byte
    {
        Unknown = 0,

        شرکت_در_آزمون = 1,
        معافیت_از_آزمون = 2
    }

    public enum BCLetterType : byte
    {
        Unknown = 0,
        الف = 1,
        ب = 2,
        //ل/11 = 3,
        //1 = 4,
        //2 = 5,
        //3 = 6,
        //4
        //9
        //10
        //11
        //د
    }

    public enum Religion : byte
    {
        Unknown = 0,
        اسلام = 1,
        مسیحیت = 2,
        يهوديت = 3,
        زرتشت = 4,
        سایر = 5
    }

    public enum Faith : byte
    {
        Unknown = 0,
        شیعه = 1,
        سنی = 2
    }

    public enum EducationGrade : byte
    {
        Unknown = 0,
        لیسانس = 4,
        فوق_لیسانس = 5,
        دکتری_حسابداری = 6,
        دکتری_مدیریت_مالی = 7,
        دکتری_سایر_رشته_ها = 8
    }

    public enum EducationFieldType : byte
    {
        Unknown = 0,
        رشته_های_مرتبط = 1,
        حسابداری_و_حسابرسی = 2,
        سایر = 3
    }

    public enum ActionState : byte
    {
        Unknown = 0,
        موارد_در_دست_اقدام = 1,
        موارد_ارسال_شده = 2,
        موارد_نهایی_شده = 3,
        همه_موارد_مربوط_به_کاربر = 10,
        همه_موارد = 20
    }

    public enum AttachmentType : short
    {
        Unknown = 0,
        تصویر_شخص = 1,
        تصویر_روی_کارت_پایان_خدمت_یا_معافیت_دائم = 2,
        تصویر_صفحه_اول_شناسنامه = 3,
        تصویر_روی_کارت_ملی = 4,
        تصویر_مدرک = 5,
        تصویر_ریز_نمرات = 6,
        تصویر_ترجمه_مدرک = 7,
        تصویر_تاییدیه_ارزشیابی_مدرک_تحصیلی_خارج_از_کشور = 8,
        تصویر_گواهی_سابقه_کار_حرفه_ای = 9,
        تصویر_سوابق_بیمه_ای_از_سایت_تامین_اجتماعی = 10,
        تصویر_مدرک_حرفه_ای_بین_المللی = 11,
        تصویر_ترجمه_مدرک_حرفه_ای_بین_المللی = 12,
        تصویر_گواهی_سابقه_کار_در_دستگاه_های_اجرایی = 13,
        احکام_صادر_شده = 14,
        چارت_سازمانی_تایید_شده = 15,
        تصویر_گواهی_ضمن_خدمت = 16,
        پاسخ_استعلام_عدم_سوء_پیشینه = 17,
        پاسخ_استعلام_عدم_اعتیاد = 18,
        پاسخ_استعلام_مدرک_تحصیلی = 19,
        پاسخ_استعلام_سابقه_کاری = 20,
        پاسخ_استعلام_حسن_انجام_کار = 21,
        تصویر_پاسخ_حراست = 22,
        تصویر_صورت_جلسه_مصاحبه = 23,
        تصویر_حکم_کارگزینی = 24,
        تصویر_حکم_هیات_علمی = 25,
        تصویر_پشت_کارت_ملی= 26,
        تصویر_پشت_کارت_پایان_خدمت_یا_معافیت_دائم = 27,
        تصویر_صفحه_دوم_شناسنامه = 28,
        تصویر_صفحه_توضیحات_شناسنامه = 29,
        مستندات_صورت_جلسه_هیات = 30,
        مستندات_اعتراض = 50

    }

    /// نوع گردش
    public enum DocumentType : byte
    {
        Unknown = 0,
        فرآیند_ثبت_نام_در_آزمون = 1,
        فرآیند_درخواست_معافیت_از_آزمون = 2,
        فرآیند_تکمیل_سوابق_کاری = 4,
        فرآیند_رسیدگی_به_اعتراض = 5
    }

    // جنسیت
    public enum GenderType : byte
    {
        زن = 1,
        مرد = 2
    }

    // فصل ها
    public enum SeasonType : byte
    {
        Unknown = 0,
        بهار = 1,
        تابستان = 2,
        پاییز = 3,
        زمستان = 4
    }

    public enum SendType : byte
    {
        Unknown = 0,
        تایید_و_ارسال = 1,
        عدم_تایید = 2,
        ارسال_جهت_رفع_نقص = 3,
        ثبت_نتیجه_آزمون = 4,
        رفع_نقص_پرونده = 5,
        ثبت_نتیجه_مصاحبه = 6,
    }

    public enum MonthType : byte
    {
        Unknown = 0,
        فروردین = 1,
        اردیبهشت = 2,
        خرداد = 3,
        تیر = 4,
        مرداد = 5,
        شهریور = 6,
        مهر = 7,
        آبان = 8,
        آذر = 9,
        دی = 10,
        بهمن = 11,
        اسفند = 12,
    }

    public enum CountryType : byte
    {
        Unknown = 0,
        ایران = 1,
        خارج_از_کشور = 2
    }

    public enum UniversityType : byte
    {
        Unknown = 0,
        داخل_کشور = 1,
        خارج_از_کشور = 2,
        سایر = 3
    }

    public enum SurveyAnswerType : byte
    {
        Unknown = 0,
        کم = 1,
        متوسط = 2,
        زیاد = 3,
        خیلی_زیاد = 4
    }

    public enum SurveyTemplateQuestionType : byte
    {
        Unknown = 0,
        عمومی = 1,
        مربوط_به_دروس = 2
    }

    public enum SurveyQuestionType : byte
    {
        Unknown = 0,
        تستی = 1,
        تشریحی = 2
    }
}
